In [32]:
pip install sqlalchemy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.8/site-packages (1.4.35)
Requirement already satisfied: greenlet!=0.4.17 in /opt/anaconda3/lib/python3.8/site-packages (from sqlalchemy) (1.0.0)

[notice] A new release of pip available: 22.1.2 -> 22.3
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [33]:
pip install psycopg2-binary

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.8/site-packages (2.9.1)

[notice] A new release of pip available: 22.1.2 -> 22.3
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [34]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [35]:
from sqlalchemy import create_engine

In [36]:
%sql postgresql://gnsiobsurufrtp:0d57af453839e69ec694c32f5af9f06d938697b08d2c4e279403aa9eeed31661@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r

creating a table

In [37]:
%%sql

DROP TABLE  IF EXISTS Address_books_crit;

CREATE TABLE Address_books_crit
 (  
    ID int,
    Title varchar(255),
    Author varchar(255),
    ISBN int,
    Publish_Date date
    
    
    );

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
Done.
Done.

[]

Inserting values

In [38]:
%%sql
INSERT INTO Address_books_crit(ID, Title, Author, ISBN, Publish_Date)
VALUES(1,'Holding Up the Universe','Null',567-456-789-5,'2002-07-05'),
      (2,'A woman makes a plan', 'Maye Musk', 983-758-274-2, '2020-04-17 '), 
      (3,'Mindset' ,'DR Carol S. Dweck',213-986-123-4,'2017-01-10'),
      (4, 'Disney Princess','kenny calvin',789-435-123-1 ,'2018-08-21'),
      (5,'The leader who had no title','maxwel mac',1847378773,'2010-04-01');

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[]

In [39]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[(1, 'Holding Up the Universe', 'Null', -683, datetime.date(2002, 7, 5)),
 (2, 'A woman makes a plan', 'Maye Musk', -51, datetime.date(2020, 4, 17)),
 (3, 'Mindset', 'DR Carol S. Dweck', -900, datetime.date(2017, 1, 10)),
 (4, 'Disney Princess', 'kenny calvin', 230, datetime.date(2018, 8, 21)),
 (5, 'The leader who had no title', 'maxwel mac', 1847378773, datetime.date(2010, 4, 1))]

Updating the values in a table created

In [40]:
%%sql

UPDATE Address_books_crit
SET author='Jennifer Niven'

WHERE id=1;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
1 rows affected.

[]

In [41]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[(2, 'A woman makes a plan', 'Maye Musk', -51, datetime.date(2020, 4, 17)),
 (3, 'Mindset', 'DR Carol S. Dweck', -900, datetime.date(2017, 1, 10)),
 (4, 'Disney Princess', 'kenny calvin', 230, datetime.date(2018, 8, 21)),
 (5, 'The leader who had no title', 'maxwel mac', 1847378773, datetime.date(2010, 4, 1)),
 (1, 'Holding Up the Universe', 'Jennifer Niven', -683, datetime.date(2002, 7, 5))]

Deleting values from a table

In [42]:

%%sql
DELETE FROM  Address_books_crit
WHERE Publish_Date='2017-01-10' AND Author = 'The leader who had no title'

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
0 rows affected.

[]

In [43]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[(2, 'A woman makes a plan', 'Maye Musk', -51, datetime.date(2020, 4, 17)),
 (3, 'Mindset', 'DR Carol S. Dweck', -900, datetime.date(2017, 1, 10)),
 (4, 'Disney Princess', 'kenny calvin', 230, datetime.date(2018, 8, 21)),
 (5, 'The leader who had no title', 'maxwel mac', 1847378773, datetime.date(2010, 4, 1)),
 (1, 'Holding Up the Universe', 'Jennifer Niven', -683, datetime.date(2002, 7, 5))]

Sorting values in ascending order

In [44]:
%%sql


SELECT
	title,
	author
	
FROM Address_books_crit
	
ORDER BY
	title ASC,
	author ASC;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[('A woman makes a plan', 'Maye Musk'),
 ('Disney Princess', 'kenny calvin'),
 ('Holding Up the Universe', 'Jennifer Niven'),
 ('Mindset', 'DR Carol S. Dweck'),
 ('The leader who had no title', 'maxwel mac')]

In [45]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[(2, 'A woman makes a plan', 'Maye Musk', -51, datetime.date(2020, 4, 17)),
 (3, 'Mindset', 'DR Carol S. Dweck', -900, datetime.date(2017, 1, 10)),
 (4, 'Disney Princess', 'kenny calvin', 230, datetime.date(2018, 8, 21)),
 (5, 'The leader who had no title', 'maxwel mac', 1847378773, datetime.date(2010, 4, 1)),
 (1, 'Holding Up the Universe', 'Jennifer Niven', -683, datetime.date(2002, 7, 5))]

Selecting only the first three rows

In [46]:
%%sql

SELECT
	title,
	author,
	Publish_Date
	
    
FROM Address_books_crit
	
ORDER BY
	title
LIMIT 3;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
3 rows affected.

[('A woman makes a plan', 'Maye Musk', datetime.date(2020, 4, 17)),
 ('Disney Princess', 'kenny calvin', datetime.date(2018, 8, 21)),
 ('Holding Up the Universe', 'Jennifer Niven', datetime.date(2002, 7, 5))]

popular one by searching

In [48]:
%%sql
ALTER TABLE Address_books_crit
Add Column Search_Count int;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
Done.

[]

In [49]:
%%sql
ALTER TABLE Address_books_crit
Add Column Book_quantity int;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
Done.

[]

Searching the most popular book

In [50]:
book_search= input("Please enter the  book title you want to search: ")
author_search= input("Please enter the book author you want to search: ")
collected_author_data = %sql SELECT author  from  Address_books_crit
collected_book_data = %sql SELECT title  from  Address_books_crit


%sql UPDATE Address_books_crit
%sql SET search_count = search_count + 1
%sql WHERE book_search = collected_book_data and author_search = collected_author_data;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
(psycopg2.errors.SyntaxError) syntax error at end of input
LINE 1: UPDATE Address_books_crit
                                 ^

[SQL: UPDATE Address_books_crit]
(Background on this error at: https://sqlalche.me/e/14/f405)
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
(psycopg2.errors.SyntaxError) syntax error at or near "+"
LINE 1: SET search_count = search_count + 1
                                        ^

[SQL: SET search_count = search_count + 1]
(Background on this error at: https://sqlalche.me/e/14/f405)
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
(psycopg2.errors.SyntaxError) syntax error at or near "WHERE"
LINE 1: WHERE book_search = collected_book_data and author_search = ...
        ^

[SQL: WHERE book_search = collected_book_data and author_search = collected_author_data;]
(Background on this error at: https://sqlalche.me/e/14/f405)